Tekla.Structures.CatalogInternal.CDelegateWrapper
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.CDelegateWrapper._instance
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.CDelegateWrapper._functionality
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.CDelegateWrapper.#ctor(Tekla.Structures.CatalogInternal.ICDelegate,Tekla.Structures.Internal.WrapperFunctionalityBase)
DO NOT USE! For internal usage only!
instance:
functionality:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportEnumerateProfiles(Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t@)
DO NOT USE! For internal usage only!
pProfileEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportProfileItemToFile(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,System.String)
DO NOT USE! For internal usage only!
pProfileItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportProfileTreeToFile(Tekla.Structures.CatalogInternal.dotcatProfileTreePath_t@,System.String)
DO NOT USE! For internal usage only!
pProfileTreePath:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportGetParametricProfilePrefixFromSubtype(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportGetProfileCrossSection(Tekla.Structures.CatalogInternal.dotcatCrossSection_t@)
DO NOT USE! For internal usage only!
pCrossSection:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportCopyProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportModifyProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportDeleteProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSaveProfileDatabase
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportImportLibraryProfilesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportInitializeImportProfilesFromFolder(Tekla.Structures.CatalogInternal.dotcatImportItem_t@,System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
item:
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportFinalizeImportProfilesFromFolder(System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportImportParametricProfilesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportImportMaterialsFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportImportCustomComponentsFromPath(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportImportRebarsFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportImportMeshesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportImportBoltAssembliesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportEnumerateMaterials(Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t@)
DO NOT USE! For internal usage only!
pMaterialEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
pMaterialItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportMaterialNameMaxLength
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportInsertMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
materialItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportModifyMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
materialItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportDeleteMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
pMaterialItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportMaterialExists(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
pMaterialItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportMaterialItemToFile(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@,System.String)
DO NOT USE! For internal usage only!
pMaterialItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportEnumerateBolts(Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t@)
DO NOT USE! For internal usage only!
pBoltEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportEnumerateBoltLengths(System.String,System.Double,System.Collections.Generic.List{System.Double}@)
DO NOT USE! For internal usage only!
Grade:
Size:
BoltLengths:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportBoltAssemblyToFile(Tekla.Structures.CatalogInternal.dotcatBoltItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportRebarToFile(Tekla.Structures.CatalogInternal.dotcatRebarItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportMeshToFile(Tekla.Structures.CatalogInternal.dotcatMeshItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.EnumerateShapes(Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportEnumeratePrinters(Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t@)
DO NOT USE! For internal usage only!
pPrinterEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportEnumerateComponents(Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t@)
DO NOT USE! For internal usage only!
pComponentEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportCustomComponentItemToFile(Tekla.Structures.CatalogInternal.dotcatComponentName_t@,System.String)
DO NOT USE! For internal usage only!
pComponentItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportShapeItemToFile(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)
DO NOT USE! For internal usage only!
pShapeItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportEnumerateUserProperties(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemEnumerator_t@)
DO NOT USE! For internal usage only!
pUserPropertyEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportInsertUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportModifyUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportDeleteUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectUserPropertyItemObjectTypes(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemObjectTypes_t@)
DO NOT USE! For internal usage only!
pUserPropertyItemObjectTypes:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportUserPropertyItemObjectTypeOperation(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemObjectTypeOperation_t@)
DO NOT USE! For internal usage only!
pUserPropertyItemObjectTypeOperation:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportGetModelPath(System.String@)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ImportShape(Tekla.Structures.CatalogInternal.dotcatShapeImport_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.ShapeExists(System.String)


Tekla.Structures.CatalogInternal.CDelegateWrapper.ShapeExistsByName(System.String)


Tekla.Structures.CatalogInternal.CDelegateWrapper.SelectShape(Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.DeleteShape(Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.InsertShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean)


Tekla.Structures.CatalogInternal.CDelegateWrapper.ModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.CleanAndModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.CleanAndModifyShapeByName(System.String,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateWrapper.RenameShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)


Tekla.Structures.CatalogInternal.CDelegateWrapper.ShapeLocation(System.String)
